{
    "content": "Varan Singh Rohila \n\nJersey City, NJ       +1-848-235-3390     varansinghrohila@gmail.com         linkedin.com/in/varan-singh-rohila   \nEXPERIENCE \n\nSenior Data Scientist, SageSure Capital Holdings, Inc., NJ\nStatistical Analysis \n\n            01/2023 – Present \n\n• \n\n• \n\n• \n\n• \n\n• \n\n• \n\n• \n\n• \n\nPost-Hurricane Damage Detection | Computer Vision \n\nLeveraged mathematics, statistics, and hypothesis testing to analyze 10,000+ hurricane claims from XACT \nXML  data,  validating  Cat  Risk  team’s  post-disaster  hypotheses  on  vinyl  siding  and  fencing  damage \nfrequency/severity, which influenced rating variable changes in the next pricing model update. \n\nSpearheaded development of a post-hurricane damage detection model using Nearmap aerial imagery and \nPyTorch, achieving 74% overall accuracy, which accelerated triaging of 30% claims and reduced claims \nprocessing time. \nCollaborated with Claims and Catastrophe RnD team to define model success criteria and integrate outputs \ninto adjuster workflows; containerized model inference using Docker to streamline deployment on AWS \nSageMaker and presented findings in stakeholder reviews to drive adoption across high-risk regions. \n\nLLMs & Document Intelligence | NLP\n\nAutomated structured data extraction from 500K+ insurance declaration PDFs using LLMs (OpenAI API), \nAWS Lambda, and SQL pipelines; reduced manual workload by 40 hours/week in contractor labor. \nBuilt  an  LLM-powered  summarization  system  to  automatically  distill  post-inspection  RCE  changes  and \nleveraging  advanced  prompt  engineering  and  an  LLM-based \npost-renewal  premium  updates, \nverification/correction  layer  to  eliminate  hallucinations  and  enforce  quality  standards  cutting  average \nreview time by 83% (4 min → 40 sec). \nProductionized  a  policy  cancellation  reason  classifier  (IBERTA)  using  BERT,  cosine  similarity,  and \ngibberish  filtering;  integrated  with  an  ETL  and  data  pipeline  leveraging  AWS  Glue  to  serve  results  to \ninternal dashboards, achieving 81% accuracy, enabling early churn detection by Customer Success teams. \n\nLeadership & Mentorship \n\nProvided  strategic  mentorship  to  Summer  2024  intern  on  the  post-hurricane  damage  project,  ensuring \nlabeling quality and efficient use of SageMaker Ground Truth for image annotation. \n\nData Science Intern, Bombora, NY\n\n• \n\n• \n\n          05/2022 - 12/2022 \nImproved downstream classifier AUC from 0.82 to 0.87 by redesigning intent topic hierarchy using BERT \nembeddings and agglomerative clustering, enhancing intent marketing for B2B clients. \nCollaborated  with  Product  and  Engineering  teams  to  integrate  improved  hierarchy  into  intent  scoring \nproducts. \n\nGraduate Research Assistant, Stevens Institute of Technology, NJ \n\nMultimodal  Embedding  Initialized  Bottleneck  Sharing  (MEIBS)\n\n          01/2022 - 07/2022 \nDeveloped \n,  a  novel  fake  news  detection \nmodel combining deep learning and cross-modal representation learning, outperforming state-of-the-art \nby 2–3% on Twitter, Weibo, and GossipCop datasets. (Thesis Link) \n\nHanlon Financial Lab Assistant, Stevens Institute of Technology, NJ\n\n• \n\n          10/2021 - 12/2021 \nMaintained  and  secured  Hanlon  Servers  against  DoS  attacks;  conducted  research  on  reinforcement \nlearning techniques. \n\nTowards Framework for Edge Computing Assisted COVID-19 Detection using CT-scan Images \n\nPAPERS \n\nICC 2021-IEEE International Conference on Communications, 2021 (First Author) \nDeep Learning Assisted COVID-19 Detection using full CT-scans \n\nEDUCATION \n\nInternet of Things (2021), p. 100377, Elsevier (First Author) \nStevens Institute of Technology, Hoboken, NJ\n\nHonors\n\nGPA\nMaster of Science in Applied Artificial Intelligence  \nNational Institute of Technology Hamirpur, H.P., India   \n\n: 3.80; \n\n:  Provost’s Master’s Fellowship, ECE Research Scholar 2022 \n\n          08/2021 – 12/2022 \n\n08/2017 – 05/2021 \n\nSKILLS \n\nBachelor of Technology in Computer Science \nLanguages & Tools:\nTechniques:\nInfra:\n\n Python, SQL, PyTorch, TensorFlow, AWS (Lambda, S3), GCP, Azure \n\n Machine Learning, NLP, Computer Vision, LLMs, Prompt Engineering, Clustering, Embeddings \n\n SageMaker, Streamlit, Spark, Git, Docker, REST APIs \n\n \n                               \n       \n \n \n                                                     \n       \n       \n \n                      \n \n                      \n \n \n \n \n \n \n        \n      \n \n \n \n \n \n          \n \n\f"
}